public_html/Python/Python-call-external-program.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Python call external program</title>
<!-- 2015-03-05 Thu 23:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />


</head>
<body>
<div id="content">
<h1 class="title">Python call external program</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1"><code>os.system</code></a></li>
<li><a href="#sec-2"><code>os.popen</code></a></li>
<li><a href="#sec-3"><code>subprocess.Popen</code></a></li>
<li><a href="#sec-4"><code>subprocess.call</code></a></li>
<li><a href="#sec-5">others</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><code>os.system</code></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>os.system("some_command with args")</code> passes the command and arguments
to your system's shell. This is nice because you can actually run
multiple commands at once in this manner and set up pipes and
input/output redirection. For example,
<code>os.system("some_command &lt; input_file | another_command &gt;
output_file")</code>
</p>

<p>
However, while this is convenient, you have to <b>manually handle the
escaping of shell characters</b> such as spaces, etc. On the other hand,
this also lets you run commands which are simply <b>shell commands</b> and
not actually external programs. <a href="https://docs.python.org/2/library/os.html#os.system">see documentation</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><code>os.popen</code></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>stream = os.popen("some_command with args")</code> will do the same thing as
<code>os.system</code> except that it gives you a file-like object that you can use
to access standard input/output for that process. There are 3 other
variants of popen that all handle the i/o slightly differently. If you
pass everything as a string, then your command is passed to the shell;
if you pass them as a list then you don't need to worry about escaping
anything. <a href="https://docs.python.org/2/library/os.html#os.popen">see documentation</a>.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><code>subprocess.Popen</code></h2>
<div class="outline-text-2" id="text-3">
<p>
The <code>Popen</code> class of the <code>subprocess</code> module. This is intended as a
replacement for <code>os.popen</code> but has the downside of being slightly more
complicated by virtue of being so comprehensive. For example, you'd
say
</p>

<p>
<code>print subprocess.Popen("echo Hello World", stdout=PIPE).stdout.read()</code>
</p>

<p>
instead of
</p>

<p>
<code>print os.popen("echo Hello World").read()</code>
</p>

<p>
but it is nice to have all of the options there in one unified class instead of 4 different popen functions.
<a href="https://docs.python.org/2/library/subprocess.html#popen-constructor">see documentation</a>.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><code>subprocess.call</code></h2>
<div class="outline-text-2" id="text-4">
<p>
The <code>call</code> function from the <code>subprocess</code> module. This is basically just
like the Popen class and takes all of the same arguments, but it
simply wait until the command completes and gives you the return code.
For example:
</p>

<p>
<code>return_code = subprocess.call("echo Hello World", shell=True)</code>
</p>

<p>
<a href="https://docs.python.org/2/library/subprocess.html#subprocess.call">see documentation</a> and <a href="http://pymotw.com/2/subprocess/">PyHowto:subprocess – Work with additional processes</a>.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">others</h2>
<div class="outline-text-2" id="text-5">
<p>
The os module also has all of the fork/exec/spawn functions.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-03-05 Thu 23:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
